---
title: ExternalServiceOptions
classe: Autodesk.Revit.DB.ExternalService.ExternalServiceOptions
namespace: Autodesk.Revit.DB.ExternalService
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExternalServiceOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsPublic { get; set; }` | `externalServiceOptions.IsPublic` | Boolean |
| `Boolean IsRecordable { get; set; }` | `externalServiceOptions.IsRecordable` | Boolean |
| `Boolean IsSelfsynchronizing { get; set; }` | `externalServiceOptions.IsSelfsynchronizing` | Boolean |
| `Boolean IsValidObject { get; }` | `externalServiceOptions.IsValidObject` | Boolean |
| `Boolean SupportActivation { get; set; }` | `externalServiceOptions.SupportActivation` | Boolean |
| `Void Dispose()` | `externalServiceOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```